In [17]:
import pandas as pd
import numpy as np

In [18]:
df_13= pd.read_csv("datos/datos-2013.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_14= pd.read_csv("datos/datos-2014.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_15= pd.read_csv("datos/datos-2015.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_16= pd.read_csv("datos/datos-2016.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_17= pd.read_csv("datos/datos-2017.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_18= pd.read_csv("datos/datos-2018.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_19= pd.read_csv("datos/datos-2019.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_20= pd.read_csv("datos/datos-2020.csv", sep= ";")
pd.set_option("display.max_columns", None)
df_21= pd.read_csv("datos/datos-2021.csv", sep= ";")
pd.set_option("display.max_columns", None)
#Falta abrir el diccionario de datos

In [19]:
df_13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4498 entries, 0 to 4497
Data columns (total 16 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   CÓDIGO ÓRGÃO SUPERIOR      4282 non-null   float64
 1   NOME ÓRGÃO SUPERIOR        2924 non-null   object
 2   CÓDIGO ÓRGÃO               4362 non-null   float64
 3   NOME ÓRGÃO                 4286 non-null   object
 4   CÓDIGO UNIDADE GESTORA     4324 non-null   float64
 5   NOME UNIDADE GESTORA       4278 non-null   object
 6   CATEGORIA ECONÔMICA        4303 non-null   object
 7   ORIGEM RECEITA             4413 non-null   object
 8   ESPÉCIE RECEITA            4355 non-null   object
 9   DETALHAMENTO               4377 non-null   object
 10  VALOR PREVISTO ATUALIZADO  4273 non-null   object
 11  VALOR LANÇADO              4282 non-null   object
 12  VALOR REALIZADO            4309 non-null   object
 13  PERCENTUAL REALIZADO       4360 non-null   object
 14  DATA LANÇAMENTO            4398 non-null   object
 15  ANO EXERCÍCIO              3374 non-null   float64
dtypes: float64(4), object(12)
memory usage: 562.4+ KB

In [20]:
df_13.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,4282.000000,4362.000000,4324.000000,3374.0
mean,31739.607660,31484.209995,232766.252775,2013.0
std,10692.607398,10810.318732,141238.719759,0.0
min,20000.000000,20101.000000,110005.000000,2013.0
25%,25000.000000,26000.000000,153978.000000,2013.0
50%,26000.000000,26292.000000,160075.000000,2013.0
75%,36000.000000,35000.000000,253003.000000,2013.0
max,81000.000000,91214.000000,913001.000000,2013.0

In [21]:
df_14.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4553 entries, 0 to 4552
Data columns (total 16 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   CÓDIGO ÓRGÃO SUPERIOR      4331 non-null   float64
 1   NOME ÓRGÃO SUPERIOR        2959 non-null   object
 2   CÓDIGO ÓRGÃO               4493 non-null   float64
 3   NOME ÓRGÃO                 4439 non-null   object
 4   CÓDIGO UNIDADE GESTORA     4332 non-null   float64
 5   NOME UNIDADE GESTORA       4392 non-null   object
 6   CATEGORIA ECONÔMICA        4502 non-null   object
 7   ORIGEM RECEITA             4487 non-null   object
 8   ESPÉCIE RECEITA            4455 non-null   object
 9   DETALHAMENTO               4506 non-null   object
 10  VALOR PREVISTO ATUALIZADO  4325 non-null   object
 11  VALOR LANÇADO              4375 non-null   object
 12  VALOR REALIZADO            4328 non-null   object
 13  PERCENTUAL REALIZADO       4437 non-null   object
 14  DATA LANÇAMENTO            4411 non-null   object
 15  ANO EXERCÍCIO              3415 non-null   float64
dtypes: float64(4), object(12)
memory usage: 569.3+ KB

In [22]:
df_14.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,4331.000000,4493.000000,4332.000000,3415.0
mean,31847.841145,31818.443356,236574.978532,2014.0
std,10813.244886,11143.198081,145862.242362,0.0
min,20000.000000,20101.000000,110005.000000,2014.0
25%,25000.000000,26000.000000,153167.000000,2014.0
50%,26000.000000,26298.000000,160075.000000,2014.0
75%,36000.000000,36201.000000,255000.000000,2014.0
max,81000.000000,91214.000000,913001.000000,2014.0

In [23]:
df_15.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4523 entries, 0 to 4522
Data columns (total 16 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   CÓDIGO ÓRGÃO SUPERIOR      4324 non-null   float64
 1   NOME ÓRGÃO SUPERIOR        2940 non-null   object
 2   CÓDIGO ÓRGÃO               4351 non-null   float64
 3   NOME ÓRGÃO                 4361 non-null   object
 4   CÓDIGO UNIDADE GESTORA     4326 non-null   float64
 5   NOME UNIDADE GESTORA       4449 non-null   object
 6   CATEGORIA ECONÔMICA        4463 non-null   object
 7   ORIGEM RECEITA             4346 non-null   object
 8   ESPÉCIE RECEITA            4320 non-null   object
 9   DETALHAMENTO               4393 non-null   object
 10  VALOR PREVISTO ATUALIZADO  4297 non-null   object
 11  VALOR LANÇADO              4381 non-null   object
 12  VALOR REALIZADO            4351 non-null   object
 13  PERCENTUAL REALIZADO       4322 non-null   object
 14  DATA LANÇAMENTO            4398 non-null   object
 15  ANO EXERCÍCIO              3392 non-null   float64
dtypes: float64(4), object(12)
memory usage: 565.5+ KB

In [24]:
df_15.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,4324.000000,4351.000000,4326.000000,3392.0
mean,31970.860315,32019.609975,237160.818770,2015.0
std,10941.671616,11465.439048,145720.161158,0.0
min,20000.000000,20101.000000,110005.000000,2015.0
25%,25000.000000,26000.000000,153173.000000,2015.0
50%,26000.000000,26298.000000,167086.000000,2015.0
75%,36000.000000,36211.000000,264001.000000,2015.0
max,81000.000000,91214.000000,913001.000000,2015.0

In [25]:
df_16.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194533 entries, 0 to 194532
Data columns (total 16 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CÓDIGO ÓRGÃO SUPERIOR      190214 non-null  float64
 1   NOME ÓRGÃO SUPERIOR        126446 non-null  object
 2   CÓDIGO ÓRGÃO               190506 non-null  float64
 3   NOME ÓRGÃO                 191144 non-null  object
 4   CÓDIGO UNIDADE GESTORA     185211 non-null  float64
 5   NOME UNIDADE GESTORA       191552 non-null  object
 6   CATEGORIA ECONÔMICA        192399 non-null  object
 7   ORIGEM RECEITA             186042 non-null  object
 8   ESPÉCIE RECEITA            190129 non-null  object
 9   DETALHAMENTO               186707 non-null  object
 10  VALOR PREVISTO ATUALIZADO  184806 non-null  object
 11  VALOR LANÇADO              188960 non-null  object
 12  VALOR REALIZADO            188766 non-null  object
 13  PERCENTUAL REALIZADO       192008 non-null  object
 14  DATA LANÇAMENTO            192088 non-null  object
 15  ANO EXERCÍCIO              145900 non-null  float64
dtypes: float64(4), object(12)
memory usage: 23.7+ MB

In [26]:
df_16.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,190214.000000,190506.000000,185211.000000,145900.0
mean,32735.986836,32087.913158,231662.563579,2016.0
std,11072.787723,10958.211896,143282.285279,0.0
min,20000.000000,20101.000000,110005.000000,2016.0
25%,26000.000000,26232.000000,153165.000000,2016.0
50%,26000.000000,26406.000000,167086.000000,2016.0
75%,39000.000000,36212.000000,253003.000000,2016.0
max,81000.000000,91214.000000,913001.000000,2016.0

In [27]:
df_17.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 190479 entries, 0 to 190478
Data columns (total 16 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CÓDIGO ÓRGÃO SUPERIOR      185999 non-null  float64
 1   NOME ÓRGÃO SUPERIOR        123811 non-null  object
 2   CÓDIGO ÓRGÃO               188418 non-null  float64
 3   NOME ÓRGÃO                 185457 non-null  object
 4   CÓDIGO UNIDADE GESTORA     186949 non-null  float64
 5   NOME UNIDADE GESTORA       188076 non-null  object
 6   CATEGORIA ECONÔMICA        187950 non-null  object
 7   ORIGEM RECEITA             181808 non-null  object
 8   ESPÉCIE RECEITA            181798 non-null  object
 9   DETALHAMENTO               186726 non-null  object
 10  VALOR PREVISTO ATUALIZADO  180955 non-null  object
 11  VALOR LANÇADO              182124 non-null  object
 12  VALOR REALIZADO            182807 non-null  object
 13  PERCENTUAL REALIZADO       186281 non-null  object
 14  DATA LANÇAMENTO            183488 non-null  object
 15  ANO EXERCÍCIO              142859 non-null  float64
dtypes: float64(4), object(12)
memory usage: 23.3+ MB

In [28]:
df_17.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,185999.000000,188418.000000,186949.000000,142859.0
mean,32547.115845,31814.245996,231583.874880,2017.0
std,10955.975665,10681.942444,142775.277196,0.0
min,20000.000000,20101.000000,110005.000000,2017.0
25%,26000.000000,26231.000000,153166.000000,2017.0
50%,26000.000000,26405.000000,167086.000000,2017.0
75%,39000.000000,36201.000000,253003.000000,2017.0
max,81000.000000,91214.000000,913001.000000,2017.0

In [29]:
df_18.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 173944 entries, 0 to 173943
Data columns (total 16 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CÓDIGO ÓRGÃO SUPERIOR      165690 non-null  float64
 1   NOME ÓRGÃO SUPERIOR        113064 non-null  object
 2   CÓDIGO ÓRGÃO               168716 non-null  float64
 3   NOME ÓRGÃO                 166611 non-null  object
 4   CÓDIGO UNIDADE GESTORA     166913 non-null  float64
 5   NOME UNIDADE GESTORA       171411 non-null  object
 6   CATEGORIA ECONÔMICA        170516 non-null  object
 7   ORIGEM RECEITA             168037 non-null  object
 8   ESPÉCIE RECEITA            166386 non-null  object
 9   DETALHAMENTO               167435 non-null  object
 10  VALOR PREVISTO ATUALIZADO  165247 non-null  object
 11  VALOR LANÇADO              170168 non-null  object
 12  VALOR REALIZADO            165640 non-null  object
 13  PERCENTUAL REALIZADO       171264 non-null  object
 14  DATA LANÇAMENTO            169298 non-null  object
 15  ANO EXERCÍCIO              130458 non-null  float64
dtypes: float64(4), object(12)
memory usage: 21.2+ MB

In [30]:
df_18.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,165690.000000,168716.000000,166913.000000,130458.0
mean,31425.408896,30759.630468,224882.574233,2018.0
std,10166.459924,9821.452882,138519.077341,0.0
min,20000.000000,20101.000000,110005.000000,2018.0
25%,25000.000000,25000.000000,154034.000000,2018.0
50%,26000.000000,26285.000000,167086.000000,2018.0
75%,36000.000000,32396.000000,240901.000000,2018.0
max,81000.000000,91214.000000,913001.000000,2018.0

In [31]:
df_19.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 176828 entries, 0 to 176827
Data columns (total 16 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CÓDIGO ÓRGÃO SUPERIOR      170865 non-null  float64
 1   NOME ÓRGÃO SUPERIOR        114938 non-null  object
 2   CÓDIGO ÓRGÃO               173643 non-null  float64
 3   NOME ÓRGÃO                 169862 non-null  object
 4   CÓDIGO UNIDADE GESTORA     171547 non-null  float64
 5   NOME UNIDADE GESTORA       174840 non-null  object
 6   CATEGORIA ECONÔMICA        174890 non-null  object
 7   ORIGEM RECEITA             168623 non-null  object
 8   ESPÉCIE RECEITA            172708 non-null  object
 9   DETALHAMENTO               172006 non-null  object
 10  VALOR PREVISTO ATUALIZADO  167987 non-null  object
 11  VALOR LANÇADO              172190 non-null  object
 12  VALOR REALIZADO            169191 non-null  object
 13  PERCENTUAL REALIZADO       170075 non-null  object
 14  DATA LANÇAMENTO            173914 non-null  object
 15  ANO EXERCÍCIO              132621 non-null  float64
dtypes: float64(4), object(12)
memory usage: 21.6+ MB

In [32]:
df_19.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,170865.000000,173643.000000,171547.000000,132621.0
mean,31409.703567,30825.272945,225092.502475,2019.0
std,10161.744743,9834.693796,139752.985581,0.0
min,20000.000000,20101.000000,110005.000000,2019.0
25%,25000.000000,25000.000000,154039.000000,2019.0
50%,26000.000000,26290.000000,167086.000000,2019.0
75%,36000.000000,32396.000000,240102.000000,2019.0
max,81000.000000,91214.000000,913001.000000,2019.0

In [33]:
df_20.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 142348 entries, 0 to 142347
Data columns (total 16 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CÓDIGO ÓRGÃO SUPERIOR      137044 non-null  float64
 1   NOME ÓRGÃO SUPERIOR        92526 non-null   object
 2   CÓDIGO ÓRGÃO               135491 non-null  float64
 3   NOME ÓRGÃO                 135255 non-null  object
 4   CÓDIGO UNIDADE GESTORA     138764 non-null  float64
 5   NOME UNIDADE GESTORA       139702 non-null  object
 6   CATEGORIA ECONÔMICA        136452 non-null  object
 7   ORIGEM RECEITA             138019 non-null  object
 8   ESPÉCIE RECEITA            137467 non-null  object
 9   DETALHAMENTO               138373 non-null  object
 10  VALOR PREVISTO ATUALIZADO  135231 non-null  object
 11  VALOR LANÇADO              140252 non-null  object
 12  VALOR REALIZADO            138063 non-null  object
 13  PERCENTUAL REALIZADO       140314 non-null  object
 14  DATA LANÇAMENTO            139954 non-null  object
 15  ANO EXERCÍCIO              106761 non-null  float64
dtypes: float64(4), object(12)
memory usage: 17.4+ MB

In [34]:
df_20.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,137044.000000,135491.000000,138764.000000,106761.0
mean,32086.125624,31579.852618,238443.493471,2020.0
std,10598.321210,10454.175702,151544.696762,0.0
min,20000.000000,20101.000000,110005.000000,2020.0
25%,25000.000000,25000.000000,154044.000000,2020.0
50%,26000.000000,26290.000000,170013.000000,2020.0
75%,39000.000000,36201.000000,253003.000000,2020.0
max,81000.000000,90000.000000,873001.000000,2020.0

In [35]:
df_21.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 134593 entries, 0 to 134592
Data columns (total 16 columns):
 #   Column                     Non-Null Count   Dtype
---  ------                     --------------   -----
 0   CÓDIGO ÓRGÃO SUPERIOR      133191 non-null  float64
 1   NOME ÓRGÃO SUPERIOR        87485 non-null   object
 2   CÓDIGO ÓRGÃO               131202 non-null  float64
 3   NOME ÓRGÃO                 129997 non-null  object
 4   CÓDIGO UNIDADE GESTORA     130352 non-null  float64
 5   NOME UNIDADE GESTORA       128118 non-null  object
 6   CATEGORIA ECONÔMICA        131846 non-null  object
 7   ORIGEM RECEITA             132106 non-null  object
 8   ESPÉCIE RECEITA            132754 non-null  object
 9   DETALHAMENTO               132439 non-null  object
 10  VALOR PREVISTO ATUALIZADO  127863 non-null  object
 11  VALOR LANÇADO              133148 non-null  object
 12  VALOR REALIZADO            129379 non-null  object
 13  PERCENTUAL REALIZADO       129104 non-null  object
 14  DATA LANÇAMENTO            130519 non-null  object
 15  ANO EXERCÍCIO              100945 non-null  float64
dtypes: float64(4), object(12)
memory usage: 16.4+ MB

In [36]:
df_21.describe()

,CÓDIGO ÓRGÃO SUPERIOR,CÓDIGO ÓRGÃO,CÓDIGO UNIDADE GESTORA,ANO EXERCÍCIO
count,133191.000000,131202.000000,130352.000000,100945.0
mean,31980.689386,31457.175340,238690.054506,2021.0
std,10477.360150,10274.244983,151288.080629,0.0
min,20000.000000,20101.000000,110005.000000,2021.0
25%,25000.000000,25000.000000,154044.000000,2021.0
50%,26000.000000,26285.000000,170013.000000,2021.0
75%,39000.000000,36000.000000,253002.000000,2021.0
max,81000.000000,90000.000000,873001.000000,2021.0